updated the README
